app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<% @users.each do |user| %>
  <a href="users/<%= user.id %>"><%= user.first_name %> <%= user.last_name %></a> <%= user.email %><br>