app/views/shoutouts/_new.html.erb

  <% @shoutouts_all.each do |shoutout| %>
    <li><strong><%= User.find_by_id(shoutout.user_id).first_name %>:</strong> <%= shoutout.content %></li>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1