app/controllers/passwords_controller.rb

  def edit
    @user = User.find_by_code(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."code" = 'ZE0niiDe5CU7isN9h4XnKQ' LIMIT 1

  def update
    @user = User.find(params[:id])

    if @user
      update_password = params.require(:user).permit(:password, :password_confirmation)
      @user.update_attributes(update_password)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 5  [["password_digest", "$2a$10$k9rLfepy037Z0nJzU345v.t9UkygK/xdkw/YKnr76y1YS7UzcR7eO"], ["updated_at", "2014-08-31 23:18:14.123826"]]