app/controllers/shoutouts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
INSERT INTO "shoutouts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "hi thereeeee"], ["created_at", "2014-09-01 21:39:22.967777"], ["updated_at", "2014-09-01 21:39:22.967777"]]
---
  def create
    user = User.find_by_id(session[:id])

    new_params = params.require(:shoutout).permit(:content)

    new_shoutout = Shoutout.new(new_params)

    if new_shoutout.save