app/controllers/sites_controller.rb

  def index
    nokogiri_trucks
    nokogiri_soups
    xml_bart

    @gaCourses = Workshop.all.order(created_at: :asc)

    @user = User.new
    @shoutout = Shoutout.new
    @like = Like.new

    @GA_SF = TWITTER_CLIENT.user_timeline('GA_SF')
    @foodtruck = TWITTER_CLIENT.user_timeline('gloungesf')

    @shoutouts_all = Shoutout.all.order(created_at: :desc)

    @current_user = User.find_by_id(session[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1