app/controllers/users_controller.rb

  def create
    new_user = params.require(:user).permit(
      :first_name,
      :last_name,
      :email,
      :password,
      :password_confirmation,
      :image_url)
    new_file_path = params[:user].permit(:image_url)

    key = Time.now.to_time.to_i

    new_bucket = S3_CLIENT.buckets['gadashboard']
    new_object = new_bucket.objects[key.to_s]

    new_object.write(Pathname.new(new_file_path['image_url'].tempfile.path))

    new_user[:image_url] = new_object.public_url.to_s
    @user = User.new(new_user)

    if @user.save
      flash[:new_user] = "Message"
      session[:id] = @user.id
      @current_user = User.find_by_id(@user.id)
---
INSERT INTO "users" ("created_at", "email", "first_name", "image_url", "last_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 7 LIMIT 1

  def update
    user = User.find(params[:id])
    updated_params = params.require(:user).permit(
      :first_name,
      :last_name,
      :email,
      :image_url)
    new_file_path = params[:user].permit(:image_url)

    puts "!!!!!!!!!#{new_file_path}!!!!!!!!!!!!!"

    if !new_file_path.blank?
      key = Time.now.to_time.to_i

      new_bucket = S3_CLIENT.buckets['gadashboard']
      new_object = new_bucket.objects[key.to_s]

      new_object.write(Pathname.new(new_file_path['image_url'].tempfile.path))

      updated_params[:image_url] = new_object.public_url.to_s
    else
      updated_params[:image_url] = user.image_url
    end

    if user.update_attributes(updated_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "users" SET "email" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = 10  [["email", "timburrs@live.com"], ["first_name", "Casey"], ["last_name", "Lawler"], ["updated_at", "2014-09-01 06:52:06.804643"]]