app/views/sites/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
---
        <% @shoutouts_all.each do |shoutout| %>
          <li><strong><%= User.find_by_id(shoutout.user_id).first_name %>:</strong> <%= shoutout.content %></li>